{"title":"记录2018年高德地图实习生面试","slug":"记录2018年高德地图实习生面试","date":"2018-04-01T01:45:56.000Z","updated":"2018-04-01T14:44:08.869Z","comments":true,"path":"api/articles/记录2018年高德地图实习生面试.json","excerpt":"记录2018年春阿里巴巴●高德地图暑期实习生面试（非技术岗）","covers":null,"content":"<p>记录2018年春阿里巴巴●高德地图暑期实习生面试（非技术岗）</p><a id=\"more\"></a><p>首先介绍下大概背景，这次来招聘的是高德地图(数据中心)部门，招聘的岗位也只有地图质量工程师和地图工艺工程师(也是面试的工程中逐渐了解到的)。</p><p>前天下午在国重有高德的技术分享会，然后就想去看看，最后竟然慢慢变成了高德地图的宣讲会了，然后就投了简历，晚上就接到通知让第二天参加面试。</p><p>也是我第一次真正的面试，还是太渣了前面投了那么多都石沉大海啊，都有点小失落了。</p><p>一共面了三面，都是连着的，中间吃了午饭，下午继续。<br>感觉我少了最后一轮 HR 面，估计凉了，说是这两天给结果，难道是套路？？</p><p>我觉得面试非技术岗也好，增加下面试经验也行啊。</p><p><strong>一面</strong>：</p><p>首先做下自我介绍，也就是那些内容，还是比较紧张的，说话也特别快，一直提醒我慢点不要急。</p><p>然后就从简历里面的项目说起，中间可能打断问一些问题主要还是：</p><p>做这个项目的初衷是什么？</p><p>在项目里面做了什么工作？具体点？</p><p>项目里面是怎么分工的？</p><p>然后某些功能点具体是怎么做的介绍下？</p><p>然后从项目里学到了哪些东西？</p><p>然后就是职业规划问题：</p><p>问以后的职业规划？</p><p>面试官也介绍了大概招聘的职位，问我倾向于那个？<br>其实到现在我才发现好像都是非技术岗，还一直以为一面就是简历面呢。</p><p>说下自己的性格特点？</p><p>可以开始实习的时间？</p><p>最后有什么问题要问我吗？</p><p>一面的感觉并不是特别好，没有太深入地介绍到自己的的优势。</p><p><strong>二面</strong>：</p><p>然后中间间隔了一二十分钟吧，紧接着就是二面。</p><p>首先也是做下自我介绍，这次好很多，就是那个套路了。</p><p>然后还是从简历里面的项目谈起，也是我主动介绍的，哈哈哈。</p><p>然后面试官翻到第二页开始从后往前看，有了经验就好了，上来就介绍我们项目的初衷。</p><p>第一的项目是《基于增强现实的校园导航系统》，我是这样说的：</p><p>当时我们是2015年上半年，接触的专业东西并不多，当时Esri中国组织了一个 GIS 大赛，我们就想参加下。也发现有些非 GIS 的人自称路痴，分不清东西南北，也看不懂地图，我们就想怎样去解决这个问题。也恰巧当时 AR 技术比较火，我们就想把 AR 和 GIS 结合起来。这就是我们的初衷。然后介绍具体是怎么做的，布拉布拉一大堆。</p><p>基本上每个项目都是这种套路。</p><p>面试官问的也特别仔细，详细到，每个项目人数、分工、具体怎么实现的等等。</p><p>和一面有点不同的是，问在项目里遇到什么困难，然后是怎么解决的？学到了哪些东西？</p><p>主要还是拿 ArcGIS 加载天地图来举例说的。</p><p>这些问题自我感觉答得不错，都聊 high 了，面试官的表情，哈哈哈。</p><p>然后问，项目的需求是不是老师事先提好的？<br>当然不是了，事实上也确实不是，我就拿 AR + 地下管线来说，是我们的自主科研项目，然后获得了学校的创新创业项目资助，全校只有30个名额云云。</p><p>然后是问到三维建模云平台了，那就直接拿出手机来看了，哈哈哈。</p><p>最后说做的都是 Android ，他们那边可能会有一些后台的开发。</p><p>我说 Android 主要用的是 Java ，Java 也可以做后端开发，其实可以很快上手的，然后就说前面那个项目的后端就是用 Java 写的，很快就上手了。</p><p>还有一些问题是和项目无关的：</p><p>对同类的地图厂商有了解吗？<br>平常会不会关注行业内的资讯？</p><p>平时有什么爱好？性格特点？</p><p>家是哪里的？</p><p>最后有什么问题要问我吗？</p><p>最后还谈到是优秀班干部，然后我趁机吹了下优秀毕业论文 前3% ，哈哈哈。</p><p>二面的感觉还是不错的，大概也是四五十分钟吧。</p><p><strong>三面</strong>：</p><p>三面是交叉面，时间是午饭后了，等得还挺久的，最后感觉好像处处都是坑啊。</p><p>两位面试官，一位主要负责提问，另一位主要负责记录。</p><p>第一个问题我很深刻，问你觉得你为什么能到第三轮面试？</p><p>接着是问这一路面试下来感觉怎么样？<br>我说最大的感觉是刚开始紧张，越来越不紧张了。（我是不是太实诚了）</p><p>为什么有这种感觉？<br>我是拿自我介绍来举例，一回生而回熟。</p><p>然后面试官就说我们这次不自我介绍了（我感觉面试官们应该沟通过了，当时10点场的刷得差不多了），刚刚是最后这个项目谈得比较好是吧，我们这次谈点其他的，说下原来没有说过的优势吧。（一身冷汗，都怀疑是不是二面的时候应该保留一点）这个回答不太好，面试官脸上的笑容消失了。</p><p>后面我感觉都是产品经理关的内容了，一环套一环的。</p><p>问这些项目需求是老师提的吗？</p><p>项目里面是怎么分工的？</p><p>如果有同学不干活怎么办？</p><p>假如做产品经理，研发不想做怎么办？<br>忘了回答：量小、领导要、求求你了好不好，头天晚上刚刚听的讲座啊。。</p><p>一个项目要想做好，最重要的是什么？</p><p>怎么获取用户需求？答调查问卷。。除了调查问卷呢？</p><p>对产品经理岗位怎么理解？</p><p>说下项目从立项到最后交付，过程是怎样的？</p><p>实现的时候遇到问题怎么解决，从中得到最大的收获是什么？</p><p>如果遇到以前从未出现过的功能怎么办，怎么选择实现的路径？<br>我是拿三维建模平台辅助拍摄来举例的。</p><p>平常测试是怎么做的？<br>怀疑当时脑袋是不是有问题，平常总说阿尔法测试、贝塔测试都没说。。</p><p>产品经理相关的内容大概就那么多吧，然后 GIS 相关的内容了：</p><p>问你所了解的 地图公司 有哪些？<br>说实话我对地图公司这个概念比较模糊，就回答了一些数据采集、提供地图服务的公司、GIS公司等等。</p><p>地图未来的发展趋势？<br>我从数据的获取、处理、可视化三个方面回答的。</p><p>目前自动驾驶等新技术不断发展，我们怎么适应这些变化，或者对我们提出了哪些要求？</p><p>然后还问了一些问题：</p><p>你的性格特点？有什么缺点？</p><p>有女朋友吗？为什么？</p><p>家在哪里？家里几口人？排行老几？</p><p>平常父母对工作的地点什么的有要求吗？</p><p>怎么看待父母的观点和自己有冲突的情况？<br>或者父母管和不管你更倾向于那种？</p><p>平常有什么爱好吗？</p><p>最后有什么问题要问我吗？</p><p>三面大概是七八十分钟吧，感觉不是太好，中间面试官有笑容消失的情况。</p><p>然后就让回来等结果了，说是这两天出结果，不过我感觉少了最后一面 HR 面，应该凉了。</p>","categories":[],"tags":[]}